import React from "react";
import FAQunit from "./FAQunit";
import style from "../css/FAQ.module.css";

const units = 
[
  {
    "question": "Хто ми?",
    "answer": "Ми - організація, яка об'єднує волонтерів для участі у різних соціальних ініціативах, намагаючись зробити світ кращим через спільні зусилля та допомогу тим, хто потребує підтримки."
}
, {
    
    question: "Як я можу створити оголошення про волонтерську подію?",
    answer: "Щоб створити оголошення, перейдіть до розділу 'Створити подію', заповніть форму з інформацією про подію, вкажіть дату, місце проведення, а також необхідні волонтерські навички."
  },
  {
    question: "Чи можу я редагувати або видаляти своє оголошення?",
    answer: "Ні, ви не можете редагувати або видаляти свої оголошення на нашому сайті. Просто зв'яжіться з адміністратором."
  },
  {
    question: "Які критерії для участі у волонтерській події?",
    answer: "Критерії можуть відрізнятися в залежності від події. Зазвичай, це вік, навички, доступність та інші фактори, які зазначені в описі події."
  },
  {
    "question": "Які події бувають?",
    "answer": "Ми організовуємо різноманітні волонтерські події, включаючи соціальні акції, екологічні ініціативи, культурні заходи, допомогу нужденним, а також благодійні заходи для збору коштів."
}
,
  {
    question: "Чи потрібно платити за участь у волонтерських подіях?",
    answer: "Зазвичай, участь у волонтерських подіях є безкоштовною. Однак деякі події можуть включати додаткові витрати, наприклад, на транспорт чи харчування, що зазначається в описі події."
  }
  
]

export function FAQ () {
  return (
    <div className={style.container}>
        
       <div className={style.faq_container}>
    <h1 className={style.text}>FAQ</h1>
        {units.map(unit => (
            <div>
                <FAQunit
                    question={unit['question']}
                    answer={unit['answer']}
                />
            </div>
        ))}
    </div>
    </div>
    
  );
};

export default FAQ;
